# пишемо програму для розрахунку витрат на місяць v0.03
# додаємо опцію головного меню
print("Вітаю друже, ця програма буде рахувати твої витрати в рамках твого місячного бюджету.")
ballance = 0
while True:
    choice_1 = int(input("\n\n\n***Головне Меню***\n1. Перевірити поточний баланс\n2. Внести суму\n3. Відняти суму\n===|||===\n(обери що ти хочеш зробити або натисни '0' щоб завершити програму)\n\n\n"))
    if choice_1 == 1:
        print(f"1. ПЕРЕВІРКА БАЛАНСА\nВаш поточний баланс: {ballance}\n")
    elif choice_1 == 2:
        deposit = float(input("2. ВНЕСЕННЯ КОШТІВ\nВпиши суму аку хочеш внести на баланс:\n"))
        ballance += deposit
    elif choice_1 == 3:
        withdraw = float(input("3. ЗНЯТТЯ КОШТІВ\nВпиши суму яку хочеш зняти з баланса:\n"))
        if withdraw <= ballance:
            ballance -= withdraw
        else:
            print("Ти не можеш зняти таку суму, у тебе не вистячає коштів на балнсі.")
    elif choice_1 == 0:
        print("0. ПРОГРАМА ЗАВЕРШЕНА")
        break
    else:
        print("Помилкове введення: оберіть 1, 2, 3 або '0' щоб завершити\n")

