#пишемо програму для розрахунку витрат на місяць v0.02
print("Вітаю друже, ця програма буде рахувати твої витрати в рамках твого місячного бюджету.")
balance = float(input("Зараз уточни, будь ласка, твій  загальний бюджет в гривнях: "))
while True:
    outcome = float(input(f"Поточний баланс: {balance} гривень.\nВпиши суму витрати (або натисни '0', якщо хочеш закінчити): "))
    if outcome == 0:
        print(f"Чудово. У тебе залишилось: {balance} гривень на рахунку.")
        break
    balance -= outcome
    if balance < 0:
        debt = abs(balance)
        print(f"Упс... ти вийшов за рамки бюджета, твій борг складає: {debt}")
        break
    else:
        print(f"Чудово. У тебе залишилось: {balance} гривень на рахунку.")